Revit 2026 API

# ConnectorHeight Property

---

The height of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual double Height { get; set; }
```
```vb
Public Overridable Property Height As Double
	Get
	Set
```
```cpp
public:
virtual property double Height {
	double get ();
	void set (double value);
}
```
```fsharp
abstract Height : float with get, set
override Height : float with get, set
```

#### Property Value

Double

#### Implements

IConnectorHeight

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's shape is not rectangular. |
| ArgumentException | Thrown when the argument is invalid. |
| InvalidOperationException | Thrown on failure to set height. |

In order to set this property, it must be mapped to a writable instance parameter in the family definition.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace